OpenROAD 79a46b62da64bbebc18f06b20c42211046de719a 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/core/runs/SUN1/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/core/runs/SUN1/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/core/runs/SUN1/results/placement/core.def
[INFO ODB-0128] Design: core
[INFO ODB-0130]     Created 10 pins.
[INFO ODB-0131]     Created 2 components and 18 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 4 connections.
[INFO ODB-0133]     Created 11 nets and 14 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/core/runs/SUN1/results/placement/core.def
###############################################################################
# Created by write_sdc
# Sun May 22 07:17:33 2022
###############################################################################
current_design core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out2}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out2}]
set_load -pin_load 0.0334 [get_ports {out1[3]}]
set_load -pin_load 0.0334 [get_ports {out1[2]}]
set_load -pin_load 0.0334 [get_ports {out1[1]}]
set_load -pin_load 0.0334 [get_ports {out1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[WARNING GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0019] Found 1 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 3
[INFO GRT-0003] Macros: 2
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vccd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[WARNING GRT-0040] Net vssd1 has wires outside die area.
[INFO GRT-0004] Blockages: 30

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal     103680         64450          37.84%
met2       Vertical        77760         46022          40.82%
met3       Horizontal      51840         32844          36.64%
met4       Vertical        31104         19805          36.33%
met5       Horizontal      10368          5112          50.69%
---------------------------------------------------------------

[INFO GRT-0197] Via related to pin nodes: 43
[INFO GRT-0198] Via related Steiner nodes: 0
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 53
[INFO GRT-0112] Final usage 3D: 593

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1             64450           170            0.26%             0 /  0 /  0
met2             46022           206            0.45%             0 /  0 /  0
met3             32844             0            0.00%             0 /  0 /  0
met4             19805             0            0.00%             0 /  0 /  0
met5              5112            58            1.13%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total           168233           434            0.26%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 3532 um
[INFO]: Setting RC values...
[INFO RSZ-0033] No hold violations found.
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL            3141.8 u
legalized HPWL           3141.8 u
delta HPWL                    0 %

min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: clk (clock source 'clk')
Endpoint: c1/clk (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.12    0.09    5.09 v clk (in)
     2    0.05                           clk (net)
                  0.12    0.00    5.09 v c1/clk (counter)
                                  5.09   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
                           0.0%       0.0%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 29964 u^2 13% utilization.
area_report_end
