OpenROAD 79a46b62da64bbebc18f06b20c42211046de719a 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/core/runs/SUN1/tmp/merged.max.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/core/runs/SUN1/tmp/merged.max.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/core/runs/SUN1/results/routing/core.def
[INFO ODB-0128] Design: core
[INFO ODB-0130]     Created 10 pins.
[INFO ODB-0131]     Created 2 components and 18 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 4 connections.
[INFO ODB-0133]     Created 11 nets and 14 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/core/runs/SUN1/results/routing/core.def
###############################################################################
# Created by write_sdc
# Sun May 22 07:17:35 2022
###############################################################################
current_design core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out2}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out2}]
set_load -pin_load 0.0334 [get_ports {out1[3]}]
set_load -pin_load 0.0334 [get_ports {out1[2]}]
set_load -pin_load 0.0334 [get_ports {out1[1]}]
set_load -pin_load 0.0334 [get_ports {out1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================

======================= Slowest Corner ===================================

No paths found.

======================= Typical Corner ===================================

No paths found.

======================= Fastest Corner ===================================

No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================

======================= Slowest Corner ===================================

No paths found.

======================= Typical Corner ===================================

No paths found.

======================= Fastest Corner ===================================

No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================

======================= Slowest Corner ===================================

Startpoint: clk (clock source 'clk')
Endpoint: c1/clk (internal pin)
Path Group: (none)
Path Type: max
Corner: ss

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.22    0.17    5.17 v clk (in)
     2    0.05                           clk (net)
                  0.22    0.00    5.17 v c1/clk (counter)
                                  5.17   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



======================= Typical Corner ===================================

Startpoint: clk (clock source 'clk')
Endpoint: c1/clk (internal pin)
Path Group: (none)
Path Type: max
Corner: tt

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.12    0.09    5.09 v clk (in)
     2    0.05                           clk (net)
                  0.12    0.00    5.09 v c1/clk (counter)
                                  5.09   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



======================= Fastest Corner ===================================

Startpoint: clk (clock source 'clk')
Endpoint: c1/clk (internal pin)
Path Group: (none)
Path Type: max
Corner: ff

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.08    0.06    5.06 v clk (in)
     2    0.05                           clk (net)
                  0.09    0.00    5.06 v c1/clk (counter)
                                  5.06   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================

======================= Slowest Corner ===================================

No paths found.

======================= Typical Corner ===================================

No paths found.

======================= Fastest Corner ===================================

No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

======================= Slowest Corner ===================================


======================= Typical Corner ===================================


======================= Fastest Corner ===================================


===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================

======================== Slowest Corner ==================================

Clock clk
No launch/capture paths found.


======================= Typical Corner ===================================

Clock clk
No launch/capture paths found.


======================= Fastest Corner ===================================

Clock clk
No launch/capture paths found.

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================


======================= Slowest Corner =================================

Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
                           0.0%       0.0%       0.0%

======================= Typical Corner ===================================

Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
                           0.0%       0.0%       0.0%


======================= Fastest Corner =================================

Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
                           0.0%       0.0%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 29964 u^2 13% utilization.
area_report_end
